#ifndef VARS_H
#define VARS_H
//------------------------------------------------------------------------------
#include "windows.h"
#include <QObject>
#include <QRect>
//------------------------------------------------------------------------------
//парметры команты
//------------------------------------------------------------------------------
typedef struct
{
    //координаты регинона относительно
    //базовых размеров пиксама корпуса
    //(решение неудоачаное, вполседстиве, необходимо)
    //принять за эталон например ГеогрКоорд)
    QRect reg;
    //список файлов, определяющих текстуру комнаты
    QStringList textures;

}TPoint;
//------------------------------------------------------------------------------
//Параметры карты
//------------------------------------------------------------------------------
typedef struct
{
    //изобраежеиение караты
    QString image;



} TMap;
//------------------------------------------------------------------------------

#endif // VARS_H
