#ifndef VARS_H
#define VARS_H
//------------------------------------------------------------------------------
#include "windows.h"
#include <QObject>
#include <QRect>
//------------------------------------------------------------------------------
//------------------------------------------------------------------------------
//структура интерактивной точки на карте
//------------------------------------------------------------------------------
typedef struct
{
    //название точки
    QString p_name;
    //назваение директории, хранящей текстуры
    QString texture_name;
    //координата точки в пискелях относительно карты
    QPoint map_point;
    //описание точки
    QString p_decsr;

} TMapPoint;
//------------------------------------------------------------------------------
//Параметры карты
//------------------------------------------------------------------------------
typedef struct
{
    //список точек
    QList<TMapPoint> points;
    //изобраежеиение караты
    QString image;

} TMap;
//------------------------------------------------------------------------------
#endif // VARS_H
